app/controllers/api/v1/water_usages_controller.rb

SELECT "water_usages".* FROM "water_usages"
---
      def index
        @water = WaterUsage.all

INSERT INTO "water_usages" ("moisture", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["moisture", 5], ["created_at", "2015-08-16 11:54:06.244456"], ["updated_at", "2015-08-16 11:54:06.244456"]]
---
      def create
        @water = WaterUsage.create(water_params)